LQM2015/stm32/Core/Src/audio_recorder.c
        audio_item.data_size = AUDIO_HALF_BUFFER_SIZE;
        audio_item.timestamp = HAL_GetTick();
        audio_item.is_half_buffer = false;  // 完整回调 = 后半缓冲区
        
        // 非阻塞方式推送到队列
        osStatus_t status = osMessageQueuePut(audio_data_queue, &audio_item, 0, 0);
        if (status != osOK) {
            // 队列满了，数据丢失
            static uint32_t queue_full_count = 0;
            queue_full_count++;
            if (queue_full_count % 10 == 1) {  // 每10次打印一次警告
                SHELL_LOG_USER_WARNING("Audio queue full in RX complete callback! Lost count: %lu", queue_full_count);
            }
        } else {
            //SHELL_LOG_USER_DEBUG("Data queued successfully in RX complete");
        }
    }
}

/**
 * @brief SAI RX half complete callback
 */
void audio_recorder_rx_half_complete_callback(void)
{
    /* Half complete - reduced debug log frequency */
    rx_half_counter++;
    if (rx_half_counter % RX_CALLBACK_LOG_INTERVAL == 0) {
        SHELL_LOG_USER_DEBUG("SAI RX half (%lu)", (unsigned long)rx_half_counter);
    }
    
    if (recorder.state == AUDIO_REC_RECORDING) {
        // 准备队列数据项 - 前半缓冲区
        AudioDataItem_t audio_item;
        
        // 复制DMA数据到独立缓冲区，避免被硬件覆盖
        uint16_t* source_ptr = &audio_buffer[0];  // 前半缓冲区
        memcpy(audio_item.data, source_ptr, AUDIO_HALF_BUFFER_SIZE);
        __DSB();  // 确保内存复制完成
        
        audio_item.data_size = AUDIO_HALF_BUFFER_SIZE;
        audio_item.timestamp = HAL_GetTick();
        audio_item.is_half_buffer = true;   // 半完成回调 = 前半缓冲区
        
        // 非阻塞方式推送到队列
        osStatus_t status = osMessageQueuePut(audio_data_queue, &audio_item, 0, 0);
        if (status != osOK) {
            // 队列满了，数据丢失
            static uint32_t queue_full_count_half = 0;
            queue_full_count_half++;
            if (queue_full_count_half % 10 == 1) {  // 每10次打印一次警告
                SHELL_LOG_USER_WARNING("Audio queue full in RX half callback! Lost count: %lu", queue_full_count_half);
            }
        }
    }
}

/**
 * @brief SAI error callback
 */
void audio_recorder_error_callback(void)
{
    SHELL_LOG_USER_ERROR("SAI error callback triggered! (state=%d)", recorder.state);
    
    if (recorder.state == AUDIO_REC_RECORDING) {
        SHELL_LOG_USER_ERROR("SAI error during recording, stopping...");
        
        // Print detailed status at the moment of error
        debug_sai_status();
        
        // Check and provide specific error guidance
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_LFSDET) {
            SHELL_LOG_USER_ERROR("Late Frame Sync detected");
            SHELL_LOG_USER_ERROR("Suggestions:");
            SHELL_LOG_USER_ERROR("1. Check external I2S clock stability");
            SHELL_LOG_USER_ERROR("2. Verify SAI configuration matches hardware");
            SHELL_LOG_USER_ERROR("3. Consider reducing DMA transfer size");
            SHELL_LOG_USER_ERROR("4. Check for SD card write bottlenecks");
            
            // Try to clear the error and continue if possible
            __HAL_SAI_CLEAR_FLAG(&hsai_BlockA4, SAI_FLAG_LFSDET);
            hsai_BlockA4.ErrorCode &= ~HAL_SAI_ERROR_LFSDET;
            
            // Don't immediately stop - try to recover
            SHELL_LOG_USER_WARNING("Attempting to continue recording after LFSDET error");
            return;
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_AFSDET) {
            SHELL_LOG_USER_ERROR("Anticipated Frame Sync detected - frame timing issue");
            SHELL_LOG_USER_ERROR("Suggestion: Verify SAI frame configuration and external codec");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_OVR) {
            SHELL_LOG_USER_ERROR("SAI Overrun - data not read fast enough");
            SHELL_LOG_USER_ERROR("Suggestion: Check DMA configuration and buffer handling");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_UDR) {
            SHELL_LOG_USER_ERROR("SAI Underrun - data not supplied fast enough");
            SHELL_LOG_USER_ERROR("Suggestion: Check DMA configuration and data flow");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_WCKCFG) {
            SHELL_LOG_USER_ERROR("Wrong Clock Configuration detected");
            SHELL_LOG_USER_ERROR("Suggestion: Verify SAI clock settings and PLL configuration");
        }
        
        recorder.state = AUDIO_REC_ERROR;
        
        // Stop DMA and close file
        HAL_SAI_DMAStop(&hsai_BlockA4);
        // if (recorder.file_open) {
        //     f_close(&recorder.file);
        //     recorder.file_open = false;
        // }
        
        SHELL_LOG_USER_ERROR("Recording stopped due to SAI error");
    }
}
